*** Now, let me level up my eshell game some more by reading ambrevar's eshell blogpost
[[https://web.archive.org/web/20201111230155/https://ambrevar.xyz/emacs-eshell/][Eshell as a main shell]]

Counterintuitive fact:- eshell doesnt run bash. Its a shell of its own.
eshell and bash are shells. When I put it that way, eshell running bash sounds absurd.
vterm and xterm are terminals.
[[https://superuser.com/a/144668/642055][Shell vs Terminal vs Console]]

Eshell does support pipe operator, aka ~|~ and output redirection using ~>~, ~>>~, ~2>~

Eshell doesnt support input redirection, aka  ~<~
^Not a big deal, because of the following trick.

Eg:- In bash, I would do:-
#+begin_src bash :results output verbatim :dir /tmp/
touch 1.txt
echo "Anoop" > 1.txt
tr 'A' 'S' < 1.txt
#+end_src

#+RESULTS:
: Snoop

In eshell, Input redirection in eshell can be achieved with the following trick:-
~cat some_file ~| some_command~
Eg:-
~cat 1.txt | tr 'A' 'S'~

But the trick doesnt work inside org babel source blocks
#+begin_src eshell :dir /tmp/ :results output
rm 1.txt
touch 1.txt
echo "Anoop" > 1.txt
cat 1.txt | tr 'A' 'S'
#+end_src

#+RESULTS:

Output can be redirected to a temp emacs buffer. This is quite fast in my experience.
#+begin_src eshell :results output verbatim
wc /tmp/temp.org >> #<buffer my-temp-buffer-name>
#+end_src

#+RESULTS:
:  13794  54898 546396 /tmp/temp.org

